driver-tests/bpelse/faulthandling/SystemFaultsJbi/test/CatchSystemFault/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://xml.netbeans.org/schema/SystemFaultsBpel/src/SystemFaultCatch/FromInvoke/XmlSchema">
  <soapenv:Body>
    <xs:Message>
      <xs:Id>messageId</xs:Id>
      <xs:Data>messageData</xs:Data>
    </xs:Message>
  </soapenv:Body>
</soapenv:Envelope>